Revit 2027 API
DuctSizeSettings.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))
public:
virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
Return Value
IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace